module {
  func.func @main(%arg0: tensor<131072x128xf32>, %arg1: tensor<131072x128xf32>, %arg2: tensor<131072x128xf32>, %arg3: tensor<131072x128xf32>, %arg4: tensor<131072x128xf32>, %arg5: tensor<131072x128xf32>, %arg6: tensor<131072x128xf32>, %arg7: tensor<131072x128xf32>, %arg8: tensor<131072x128xf32>, %arg9: tensor<131072x128xf32>, %arg10: tensor<131072x128xf32>, %arg11: tensor<131072x128xf32>, %arg12: tensor<131072x128xf32>, %arg13: tensor<131072x128xf32>, %arg14: tensor<131072x128xf32>, %arg15: tensor<131072x128xf32>, %arg16: tensor<131072x128xf32>, %arg17: tensor<131072x128xf32>, %arg18: tensor<131072x128xf32>, %arg19: tensor<131072x128xf32>, %arg20: tensor<131072x128xf32>, %arg21: tensor<131072x128xf32>, %arg22: tensor<131072x128xf32>, %arg23: tensor<131072x128xf32>, %arg24: tensor<131072x128xf32>, %arg25: tensor<131072x128xf32>, %arg26: tensor<131072x128xf32>, %arg27: tensor<131072x128xf32>, %arg28: tensor<131072x128xf32>, %arg29: tensor<131072x128xf32>, %arg30: tensor<131072x128xf32>, %arg31: tensor<131072x128xf32>, %arg32: tensor<131072x128xf32>, %arg33: tensor<131072x128xf32>, %arg34: tensor<131072x128xf32>, %arg35: tensor<131072x128xf32>, %arg36: tensor<131072x128xf32>, %arg37: tensor<131072x128xf32>, %arg38: tensor<131072x128xf32>, %arg39: tensor<131072x128xf32>, %arg40: tensor<131072x128xf32>, %arg41: tensor<131072x128xf32>, %arg42: tensor<131072x128xf32>, %arg43: tensor<131072x128xf32>, %arg44: tensor<131072x128xf32>, %arg45: tensor<131072x128xf32>, %arg46: tensor<131072x128xf32>, %arg47: tensor<131072x128xf32>, %arg48: tensor<131072x128xf32>, %arg49: tensor<131072x128xf32>, %arg50: tensor<131072x128xf32>, %arg51: tensor<131072x128xf32>, %arg52: tensor<131072x128xf32>, %arg53: tensor<131072x128xf32>, %arg54: tensor<131072x128xf32>, %arg55: tensor<131072x128xf32>, %arg56: tensor<131072x128xf32>, %arg57: tensor<131072x128xf32>, %arg58: tensor<131072x128xf32>, %arg59: tensor<131072x128xf32>, %arg60: tensor<131072x128xf32>, %arg61: tensor<131072x128xf32>, %arg62: tensor<131072x128xf32>, %arg63: tensor<131072x128xf32>, %arg64: tensor<3x1xi64>, %arg65: tensor<3x8x7x128xf32>, %arg66: tensor<3x8x7x128xf32>, %arg67: tensor<3x8x7x128xf32>, %arg68: tensor<3x8x7x128xf32>, %arg69: tensor<3x8x7x128xf32>, %arg70: tensor<3x8x7x128xf32>, %arg71: tensor<3x8x7x128xf32>, %arg72: tensor<3x8x7x128xf32>, %arg73: tensor<3x8x7x128xf32>, %arg74: tensor<3x8x7x128xf32>, %arg75: tensor<3x8x7x128xf32>, %arg76: tensor<3x8x7x128xf32>, %arg77: tensor<3x8x7x128xf32>, %arg78: tensor<3x8x7x128xf32>, %arg79: tensor<3x8x7x128xf32>, %arg80: tensor<3x8x7x128xf32>, %arg81: tensor<3x8x7x128xf32>, %arg82: tensor<3x8x7x128xf32>, %arg83: tensor<3x8x7x128xf32>, %arg84: tensor<3x8x7x128xf32>, %arg85: tensor<3x8x7x128xf32>, %arg86: tensor<3x8x7x128xf32>, %arg87: tensor<3x8x7x128xf32>, %arg88: tensor<3x8x7x128xf32>, %arg89: tensor<3x8x7x128xf32>, %arg90: tensor<3x8x7x128xf32>, %arg91: tensor<3x8x7x128xf32>, %arg92: tensor<3x8x7x128xf32>, %arg93: tensor<3x8x7x128xf32>, %arg94: tensor<3x8x7x128xf32>, %arg95: tensor<3x8x7x128xf32>, %arg96: tensor<3x8x7x128xf32>, %arg97: tensor<3x8x7x128xf32>, %arg98: tensor<3x8x7x128xf32>, %arg99: tensor<3x8x7x128xf32>, %arg100: tensor<3x8x7x128xf32>, %arg101: tensor<3x8x7x128xf32>, %arg102: tensor<3x8x7x128xf32>, %arg103: tensor<3x8x7x128xf32>, %arg104: tensor<3x8x7x128xf32>, %arg105: tensor<3x8x7x128xf32>, %arg106: tensor<3x8x7x128xf32>, %arg107: tensor<3x8x7x128xf32>, %arg108: tensor<3x8x7x128xf32>, %arg109: tensor<3x8x7x128xf32>, %arg110: tensor<3x8x7x128xf32>, %arg111: tensor<3x8x7x128xf32>, %arg112: tensor<3x8x7x128xf32>, %arg113: tensor<3x8x7x128xf32>, %arg114: tensor<3x8x7x128xf32>, %arg115: tensor<3x8x7x128xf32>, %arg116: tensor<3x8x7x128xf32>, %arg117: tensor<3x8x7x128xf32>, %arg118: tensor<3x8x7x128xf32>, %arg119: tensor<3x8x7x128xf32>, %arg120: tensor<3x8x7x128xf32>, %arg121: tensor<3x8x7x128xf32>, %arg122: tensor<3x8x7x128xf32>, %arg123: tensor<3x8x7x128xf32>, %arg124: tensor<3x8x7x128xf32>, %arg125: tensor<3x8x7x128xf32>, %arg126: tensor<3x8x7x128xf32>, %arg127: tensor<3x8x7x128xf32>, %arg128: tensor<3x8x7x128xf32>) -> (tensor<3x1x4096xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>, tensor<3x8x8x128xf32>) {
    %cst = stablehlo.constant dense<1.000000e+00> : tensor<1xf32>
    %cst_0 = stablehlo.constant dense<4.096000e+03> : tensor<f64>
    %cst_1 = stablehlo.constant dense<8.000000e+00> : tensor<f64>
    %cst_2 = stablehlo.constant dense<0.000000e+00> : tensor<3x4096xf32>
    %cst_3 = stablehlo.constant dense<11.3137083> : tensor<1xf32>
    %cst_4 = stablehlo.constant dense<9.99999974E-6> : tensor<1xf32>
    %cst_5 = stablehlo.constant dense<4.096000e+03> : tensor<1xf32>
    %cst_6 = stablehlo.constant dense<2.000000e+00> : tensor<1xf32>
    %c = stablehlo.constant dense<0> : tensor<1xi64>
    %c_7 = stablehlo.constant dense<0> : tensor<4096xi64>
    %c_8 = stablehlo.constant dense<1> : tensor<4096xi64>
    %c_9 = stablehlo.constant dense<0> : tensor<8xi64>
    %c_10 = stablehlo.constant dense<1> : tensor<8xi64>
    %c_11 = stablehlo.constant dense<7> : tensor<1xi64>
    %c_12 = stablehlo.constant dense<1> : tensor<1xi64>
    %cst_13 = stablehlo.constant dense<0.000000e+00> : tensor<4096x14336xf32>
    %cst_14 = stablehlo.constant dense<0.000000e+00> : tensor<14336x4096xf32>
    %cst_15 = stablehlo.constant dense<0.000000e+00> : tensor<8x4096xf32>
    %cst_16 = stablehlo.constant dense<0.000000e+00> : tensor<1024x4096xf32>
    %cst_17 = stablehlo.constant dense<0.000000e+00> : tensor<4096x4096xf32>
    %cst_18 = stablehlo.constant dense<0.000000e+00> : tensor<4096xf32>
    %cst_19 = stablehlo.constant dense<0.000000e+00> : tensor<32000x4096xf32>
    %c1_i64 = arith.constant 1 : i64
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %cst_20 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %c_21 = stablehlo.constant dense<1> : tensor<2xi64>
    %c_22 = stablehlo.constant dense<0> : tensor<2xi64>
    %c_23 = stablehlo.constant dense<[-1, 4096]> : tensor<2xi64>
    %c2_i64 = arith.constant 2 : i64
    %c_24 = stablehlo.constant dense<[0, 1]> : tensor<2xi64>
    %c4096_i64 = arith.constant 4096 : i64
    %c4096 = arith.constant 4096 : index
    %cst_25 = stablehlo.constant dense<1.000000e+00> : tensor<f64>
    %0 = stablehlo.divide %cst_25, %cst_25 : tensor<f64>
    %1 = stablehlo.ceil %0 : tensor<f64>
    %2 = stablehlo.convert %1 : (tensor<f64>) -> tensor<i64>
    %3 = stablehlo.reshape %2 : (tensor<i64>) -> tensor<1xi64>
    %4 = stablehlo.dynamic_iota %3, dim = 0 : (tensor<1xi64>) -> tensor<1xi64>
    %5 = stablehlo.broadcast_in_dim %4, dims = [0] : (tensor<1xi64>) -> tensor<1xi64>
    %6 = stablehlo.multiply %5, %c_12 : tensor<1xi64>
    %7 = stablehlo.broadcast_in_dim %6, dims = [0] : (tensor<1xi64>) -> tensor<1xi64>
    %8 = stablehlo.add %7, %c_11 : tensor<1xi64>
    %9 = stablehlo.reshape %8 : (tensor<1xi64>) -> tensor<1x1xi64>
    %10 = stablehlo.reshape %9 : (tensor<1x1xi64>) -> tensor<1x1xi64>
    %11 = "stablehlo.gather"(%cst_19, %arg64) <{dimension_numbers = #stablehlo.gather<offset_dims = [2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 2>, indices_are_sorted = false, slice_sizes = array<i64: 1, 4096>}> : (tensor<32000x4096xf32>, tensor<3x1xi64>) -> tensor<3x1x4096xf32>
    %12 = stablehlo.convert %11 : tensor<3x1x4096xf32>
    %13 = stablehlo.reshape %cst_6 : (tensor<1xf32>) -> tensor<f32>
    %14 = stablehlo.broadcast_in_dim %12, dims = [0, 1, 2] : (tensor<3x1x4096xf32>) -> tensor<3x1x4096xf32>
    %15 = stablehlo.broadcast_in_dim %13, dims = [] : (tensor<f32>) -> tensor<3x1x4096xf32>
    %16 = stablehlo.power %14, %15 : tensor<3x1x4096xf32>
    %17 = stablehlo.reduce(%16 init: %cst_20) applies stablehlo.add across dimensions = [2] : (tensor<3x1x4096xf32>, tensor<f32>) -> tensor<3x1xf32>
    %18 = stablehlo.reshape %17 : (tensor<3x1xf32>) -> tensor<3x1x1xf32>
    %19 = stablehlo.reshape %cst_5 : (tensor<1xf32>) -> tensor<f32>
    %20 = stablehlo.broadcast_in_dim %18, dims = [0, 1, 2] : (tensor<3x1x1xf32>) -> tensor<3x1x1xf32>
    %21 = stablehlo.broadcast_in_dim %19, dims = [] : (tensor<f32>) -> tensor<3x1x1xf32>
    %22 = stablehlo.divide %20, %21 : tensor<3x1x1xf32>
    %23 = stablehlo.reshape %cst_4 : (tensor<1xf32>) -> tensor<f32>
    %24 = stablehlo.broadcast_in_dim %22, dims = [0, 1, 2] : (tensor<3x1x1xf32>) -> tensor<3x1x1xf32>
    %25 = stablehlo.broadcast_in_dim %23, dims = [] : (tensor<f32>) -> tensor<3x1x1xf32>
    %26 = stablehlo.add %24, %25 : tensor<3x1x1xf32>
    %27 = stablehlo.rsqrt %26 : tensor<3x1x1xf32>
    %28 = stablehlo.broadcast_in_dim %27, dims = [0, 1, 2] : (tensor<3x1x1xf32>) -> tensor<3x1x4096xf32>
    %29 = stablehlo.multiply %14, %28 : tensor<3x1x4096xf32>
    %30 = stablehlo.broadcast_in_dim %29, dims = [0, 1, 2] : (tensor<3x1x4096xf32>) -> tensor<3x1x4096xf32>
    %31 = stablehlo.broadcast_in_dim %cst_18, dims = [2] : (tensor<4096xf32>) -> tensor<3x1x4096xf32>
    %32 = stablehlo.multiply %30, %31 : tensor<3x1x4096xf32>
    %33 = stablehlo.transpose %cst_17, dims = [1, 0] : (tensor<4096x4096xf32>) -> tensor<4096x4096xf32>
    %34 = stablehlo.reshape %32 : (tensor<3x1x4096xf32>) -> tensor<3x4096xf32>
    %35 = stablehlo.dot %34, %33 : (tensor<3x4096xf32>, tensor<4096x4096xf32>) -> tensor<3x4096xf32>
    %36 = stablehlo.reshape %35 : (tensor<3x4096xf32>) -> tensor<3x1x4096xf32>
    %37 = stablehlo.transpose %cst_16, dims = [1, 0] : (tensor<1024x4096xf32>) -> tensor<4096x1024xf32>
    %38 = stablehlo.dot %34, %37 : (tensor<3x4096xf32>, tensor<4096x1024xf32>) -> tensor<3x1024xf32>
    %39 = stablehlo.reshape %38 : (tensor<3x1024xf32>) -> tensor<3x1x1024xf32>
    %40 = stablehlo.reshape %36 : (tensor<3x1x4096xf32>) -> tensor<3x1x32x128xf32>
    %41 = stablehlo.transpose %40, dims = [0, 2, 1, 3] : (tensor<3x1x32x128xf32>) -> tensor<3x32x1x128xf32>
    %42 = stablehlo.reshape %39 : (tensor<3x1x1024xf32>) -> tensor<3x1x8x128xf32>
    %43 = stablehlo.transpose %42, dims = [0, 2, 1, 3] : (tensor<3x1x8x128xf32>) -> tensor<3x8x1x128xf32>
    %44 = stablehlo.slice %arg0 [0:8, 0:128] : (tensor<131072x128xf32>) -> tensor<8x128xf32>
    %45 = stablehlo.slice %arg1 [0:8, 0:128] : (tensor<131072x128xf32>) -> tensor<8x128xf32>
    %46 = stablehlo.reshape %10 : (tensor<1x1xi64>) -> tensor<1x1x1xi64>
    %47 = "stablehlo.gather"(%44, %46) <{dimension_numbers = #stablehlo.gather<offset_dims = [2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 2>, indices_are_sorted = false, slice_sizes = array<i64: 1, 128>}> : (tensor<8x128xf32>, tensor<1x1x1xi64>) -> tensor<1x1x128xf32>
    %48 = stablehlo.reshape %47 : (tensor<1x1x128xf32>) -> tensor<1x1x1x128xf32>
    %49 = "stablehlo.gather"(%45, %46) <{dimension_numbers = #stablehlo.gather<offset_dims = [2], collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 2>, indices_are_sorted = false, slice_sizes = array<i64: 1, 128>}> : (tensor<8x128xf32>, tensor<1x1x1xi64>) -> tensor<1x1x128xf32>
    %50 = stablehlo.reshape %49 : (tensor<1x1x128xf32>) -> tensor<1x1x1x128xf32>
    %51 = stablehlo.broadcast_in_dim %41, dims = [0, 1, 2, 3] : (tensor<3x32x1x128xf32>) -> tensor<3x32x1x128xf32>
    %52 = stablehlo.broadcast_in_dim %48, dims = [0, 1, 2, 3] : (tensor<1x1x1x128xf32>) -> tensor<3x32x1x128xf32>
    %53 = stablehlo.multiply %51, %52 : tensor<3x32x1x128xf32>
    %54 = stablehlo.slice %41 [0:3, 0:32, 0:1, 0:64] : (tensor<3x32x1x128xf32>) -> tensor<3x32x1x64xf32>
    %55 = stablehlo.slice %41 [0:3, 0:32, 0:1, 64:128] : (tensor<3x32x1x128xf32>) -> tensor<3x32x1x64xf32>
    %56 = stablehlo.negate %55 : tensor<3x32x1x64xf32>
    %57 = stablehlo.concatenate %56, %54, dim = 3 : (tensor<3x32x1x64xf32>, tensor<3x32x1x64xf32>) -> tensor<3x32x1x128xf32>
    %58 = stablehlo.broadcast_in_dim %57, dims = [0, 1, 2, 3] : (tensor<3x32x1x128xf32>) -> tensor<3x32x1x128xf32>
    %59 = stablehlo.broadcast_in_dim %50, dims = [0, 1, 2, 3] : (tensor<1x1x1x128xf32>) -> tensor<3x32x1x128xf32>
    %60 = stablehlo.multiply %58, %59 : tensor<3x32x1x128xf32>
    %61 = stablehlo.add %53, %60 : tensor<3x32x1x128xf32>
    %62 = stablehlo.broadcast_in_dim %43, dims = [0, 1, 2, 3] : (tensor<3x8x1x128xf32>) -> tensor<3x8x1x128xf32>
    %63 = stablehlo.broadcast_in_dim %48, dims = [0, 1, 2, 3] : (tensor<1x1x1x128xf32>) -> tensor<3x8x1x128xf32>
    %64 = stablehlo.multiply %62, %63 : tensor<3x8x1x128xf32>
    %65 = stablehlo.slice %43 [0:3, 0:8, 0:1, 0:64] : (tensor<3x8x1x128xf32>) -> tensor<3x8x1x64xf32>
    %66 = stablehlo.slice %43 [0:3, 0:8, 0:1, 64:128] : (tensor<3x8x1x128xf32>) -> tensor<3x8x1x64xf32>
    %67 = stablehlo.negate %66 : tensor<3x8x1x64xf32>
    %68 = stablehlo.concatenate %67, %65, dim = 3 : (tensor<3x8x1x64xf32>, tensor<3x8x1x64xf32>) -> tensor<3x8x1x128xf32>
    %69 = stablehlo.broadcast_in_dim %68, dims = [0, 1, 2, 3] : (tensor<3x8x1x128xf32>) -> tensor<3x8x1x128xf32>
    %70 = stablehlo.broadcast_in_dim %50, dims = [0, 1, 2, 3] : (tensor<1x1x1x128xf32>) -> tensor<3x8x1x128xf32>
    %71 = stablehlo.multiply %69, %70 : tensor<3x8x1x128xf32>
    %72 = stablehlo.add %64, %71 : tensor<3x8x1x128xf32>
    %73 = stablehlo.concatenate %arg65, %72, dim = 2 : (tensor<3x8x7x128xf32>, tensor<3x8x1x128xf32>) -> tensor<3x8x8x128xf32>
    %74 = stablehlo.concatenate %arg66, %43, dim = 2 : (tensor<3x8x7x128xf32>, tensor<3x8x1x128xf32>) -> tensor<3x8x8x128xf32>
    %75 = stablehlo.reshape %73 : (tensor<3x8x8x128xf32>) -> tensor<3x8x1x8x128xf32>
    %76 = stablehlo.broadcast_in_dim %75, dims = [0, 1, 2, 3, 4] : (tensor<3x8x1x8x128xf32>) -> tensor<3x8x4x8x128xf32>
    %77 = stablehlo.reshape %76 : (tensor<3x8x4x8x128xf32>) -> tensor<3x32x8x128xf32>
    %78 = stablehlo.reshape %74 : (tensor<3x8x8x128xf32>) -> tensor<3x8x1x8x128xf32>
    %79 = stablehlo.broadcast_in_dim %78, dims = [0, 1, 2, 3, 4] : (tensor<3x8x1x8x128xf32>) -> tensor<3x8x4x8x128xf32>
    %80 = stablehlo.reshape %79 : (tensor<3x8x4x8x128xf32>) -> tensor<3x32x8x128xf32>
    %81 = stablehlo.transpose %77, dims = [0, 1, 3, 2] : (tensor<3x32x8x128xf32>) -> tensor<3x32x128x8xf32>
    %82 = stablehlo.reshape %61 : (tensor<3x32x1x128xf32>) -> tensor<96x1x128xf32>
    %83 = stablehlo.reshape %81 : (tensor<3x32x128x8xf32>) -> tensor<96x128x8xf32>
    %84 = stablehlo.broadcast_in_dim %83, dims = [0, 1, 2] : (tensor<96x128x8xf32>) -> tensor<96x128x8xf32>
    %85 = stablehlo.dot_general %82, %84, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<96x1x128xf32>, tensor<96x128x8xf32>) -> tensor<96x1x8xf32>
    %86 = stablehlo.reshape %85 : (tensor<96x1x8xf32>) -> tensor<3x32x1x8xf32>
    %87 = stablehlo.reshape %cst_3 : (tensor<1xf32>) -> tensor<f32>
    %88 = stablehlo.broadcast_in_dim %86, dims = [0, 1, 2, 3] : (tensor<3x32x1x8xf32>) -> tensor<3x32x1x8xf32>
    %89 = stablehlo.broadcast_in_dim %87, dims = [] : (tensor<f32>) -> tensor<3x32x1x8xf32>
    %90 = stablehlo.divide %88, %89 : tensor<3x32x1x8xf32>
    %91 = stablehlo.custom_call @byteir.softmax(%90) {byteir_attrs = {axis = 3 : i64}} : (tensor<3x32x1x8xf32>) -> tensor<3x32x1x8xf32>
    %92 = stablehlo.reshape %91 : (tensor<3x32x1x8xf32>) -> tensor<96x1x8xf32>
    %93 = stablehlo.reshape %80 : (tensor<3x32x8x128xf32>) -> tensor<96x8x128xf32>
    %94 = stablehlo.broadcast_in_dim %93, dims = [0, 1, 2] : (tensor<96x8x128xf32>) -> tensor<96x8x128xf32>
    %95 = stablehlo.dot_general %92, %94, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<96x1x8xf32>, tensor<96x8x128xf32>) -> tensor<96x1x128xf32>
    %96 = stablehlo.reshape %95 : (tensor<96x1x128xf32>) -> tensor<3x32x1x128xf32>
    %97 = stablehlo.transpose %96, dims = [0, 2, 1, 3] : (tensor<3x32x1x128xf32>) -> tensor<3x1x32x128xf32>
    %98 = stablehlo.reshape %97 : (tensor<3x1x32x128xf32>) -> tensor<3x1x4096xf32>
    %99 = stablehlo.reshape %98 : (tensor<3x1x4096xf32>) -> tensor<3x4096xf32>
    %100 = stablehlo.dot %99, %33 : (tensor<3x4096xf32>, tensor<4096x4096xf32>) -> tensor<3x4096xf32>
    %101 = stablehlo.reshape %100 : (tensor<3x4096xf32>) -> tensor<3x1x4096xf32>
    %102 = stablehlo.add %12, %101 : tensor<3x1x4096xf32>
    %103 = stablehlo.broadcast_in_dim %102, dims = [0, 1, 2] : (tensor<3x1x4096xf32>) -> tensor<3x1x4096xf32>
    %104 = stablehlo.power %103, %15 : tensor<3x1x4096xf32>
    %105 = stablehlo.reduce(%104 init: %cst_20) applies stablehlo.add across dimensions = [2] : (tensor<3x1x4096xf32>, tensor<f32>) -> tensor<3x1xf32>
    %106 = stablehlo.reshape %105 : (tensor<3x1xf32>) -> tensor<3x1x1xf32>
    %107 = stablehlo.broadcast_in_dim %106, dims = [0, 1, 2] : (tensor<3x1x1xf32>) -> tensor<3x1x1xf32>
    %108 = stablehlo.divide %107, %21 : tensor<3x1x1xf32>
    %109 = stablehlo.broadcast_in_dim %108, dims = [0, 1, 2] : (tensor<3x1x1xf32>) -> tensor<3x1x1xf32>
    %110 = stablehlo.add %109, %25 : tensor<3x1x1xf32>
    %111 = stablehlo.rsqrt %110 : tensor<3x1x1xf32>
    %112 = stablehlo.broadcast_in_dim %111, dims = [0, 1, 2] : (tensor<3x1x1xf32>) -> tensor<3x1x4096xf32>
    %113 = stablehlo.multiply %103, %112 : tensor<3x1x4096xf32>
    %114 = stablehlo.broadcast_in_dim %113, dims = [0, 1, 2] : (tensor<3x1x4096xf32>) -> tensor<3x1x4096xf32>
    %115 = stablehlo.multiply %114, %31 : tensor<3x1x4096xf32>
    %116 = stablehlo.reshape %115 : (tensor<3x1x4096xf32>) -> tensor<3x4096xf32>
    %117 = stablehlo.transpose %cst_15, dims = [1, 0] : (tensor<8x4096xf32>) -> tensor<4096x8xf32>
    %118 = stablehlo.dot %116, %117 : (tensor<3x4096xf32>, tensor<4096x8xf32>) -> tensor<3x8xf32>
    %119 = stablehlo.custom_call @byteir.softmax(%118) {byteir_attrs = {axis = 1 : i64}} : (tensor<3x8xf32>) -> tensor<3x8xf32>
    %120:2 = stablehlo.custom_call @byteir.top_k(%119) {byteir_attrs = {axis = [1], k = 2 : i64, sorted = true}} : (tensor<3x8xf32>) -> (tensor<3x2xf32>, tensor<3x2xi64>)
    %121 = stablehlo.reduce(%120#0 init: %cst_20) applies stablehlo.add across dimensions = [1] : (tensor<3x2xf32>, tensor<f32>) -> tensor<3xf32>
    %122 = stablehlo.reshape %121 : (tensor<3xf32>) -> tensor<3x1xf32>
    %123 = stablehlo.broadcast_in_dim %120#0, dims = [0, 1] : (tensor<3x2xf32>) -> tensor<3x2xf32>
    %124 = stablehlo.broadcast_in_dim %122, dims = [0, 1] : (tensor<3x1xf32>) -> tensor<3x2xf32>
    %125 = stablehlo.divide %123, %124 : tensor<3x2xf32>
    %126 = stablehlo.divide %cst_1, %cst_25 : tensor<f64>
    %127 = stablehlo.ceil %126 : tensor<f64>
    %128 = stablehlo.convert %127 : (tensor<f64>) -> tensor<i64>
    %129 = stablehlo.reshape %128 : (tensor<i64>) -> tensor<1xi64>
    %130 = stablehlo.dynamic_iota %129, dim = 0 : (tensor<1xi64>) -> tensor<8xi64>
    %131 = stablehlo.broadcast_in_dim %130, dims = [0] : (tensor<8xi64>) -> tensor<8xi64>
    %132 = stablehlo.multiply %131, %c_10 : tensor<8xi64>
    %133 = stablehlo.broadcast_in_dim %132, dims = [0] : (tensor<8xi64>) -> tensor<8xi64>
    %134 = stablehlo.add %133, %c_9 : tensor<8xi64>
    %135 = stablehlo.reshape %120#1 : (tensor<3x2xi64>) -> tensor<3x2x1xi64>
    %136 = stablehlo.broadcast_in_dim %135, dims = [0, 1, 2] : (tensor<3x2x1xi64>) -> tensor<3x2x8xi64>
    %137 = stablehlo.broadcast_in_dim %134, dims = [2] : (tensor<8xi64>) -> tensor<3x2x8xi64>
    %138 = stablehlo.compare  EQ, %136, %137,  SIGNED : (tensor<3x2x8xi64>, tensor<3x2x8xi64>) -> tensor<3x2x8xi1>
    %139 = stablehlo.convert %138 : (tensor<3x2x8xi1>) -> tensor<3x2x8xi64>
    %140 = stablehlo.transpose %139, dims = [2, 1, 0] : (tensor<3x2x8xi64>) -> tensor<8x2x3xi64>
    %141 = stablehlo.slice %140 [0:1, 0:2, 0:3] : (tensor<8x2x3xi64>) -> tensor<1x2x3xi64>
    %142 = stablehlo.reshape %141 : (tensor<1x2x3xi64>) -> tensor<2x3xi64>
    %143 = stablehlo.custom_call @byteir.non_zero(%142) {byteir_attrs = {}} : (tensor<2x3xi64>) -> tensor<?x2xi64>
    %dim = tensor.dim %143, %c0 : tensor<?x2xi64>
    %144 = arith.index_cast %dim : index to i64
    %from_elements = tensor.from_elements %144, %c1_i64 : tensor<2xi64>
    %145 = stablehlo.real_dynamic_slice %143, %c_22, %from_elements, %c_21 : (tensor<?x2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %dim_26 = tensor.dim %145, %c0 : tensor<?x1xi64>
    %146 = arith.index_cast %dim_26 : index to i64
    %from_elements_27 = tensor.from_elements %146 : tensor<1xi64>
    %147 = stablehlo.dynamic_reshape %145, %from_elements_27 : (tensor<?x1xi64>, tensor<1xi64>) -> tensor<?xi64>
    %from_elements_28 = tensor.from_elements %144, %c2_i64 : tensor<2xi64>
    %148 = stablehlo.real_dynamic_slice %143, %c_24, %from_elements_28, %c_21 : (tensor<?x2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %dim_29 = tensor.dim %148, %c0 : tensor<?x1xi64>
    %149 = arith.index_cast %dim_29 : index to i64
    %from_elements_30 = tensor.from_elements %149 : tensor<1xi64>
    %150 = stablehlo.dynamic_reshape %148, %from_elements_30 : (tensor<?x1xi64>, tensor<1xi64>) -> tensor<?xi64>
    %151 = stablehlo.reshape %116 : (tensor<3x4096xf32>) -> tensor<1x3x4096xf32>
    %152 = stablehlo.divide %cst_0, %cst_25 : tensor<f64>
    %153 = stablehlo.ceil %152 : tensor<f64>
    %154 = stablehlo.convert %153 : (tensor<f64>) -> tensor<i64>
    %155 = stablehlo.reshape %154 : (tensor<i64>) -> tensor<1xi64>
    %156 = stablehlo.dynamic_iota %155, dim = 0 : (tensor<1xi64>) -> tensor<4096xi64>
    %157 = stablehlo.broadcast_in_dim %156, dims = [0] : (tensor<4096xi64>) -> tensor<4096xi64>
    %158 = stablehlo.multiply %157, %c_8 : tensor<4096xi64>
    %159 = stablehlo.broadcast_in_dim %158, dims = [0] : (tensor<4096xi64>) -> tensor<4096xi64>
    %160 = stablehlo.add %159, %c_7 : tensor<4096xi64>
    %dim_31 = tensor.dim %150, %c0 : tensor<?xi64>
    %161 = arith.index_cast %dim_31 : index to i64
    %from_elements_32 = tensor.from_elements %161, %c1_i64 : tensor<2xi64>
    %162 = stablehlo.dynamic_reshape %150, %from_elements_32 : (tensor<?xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %163 = stablehlo.divide %cst_25, %cst_25 : tensor<f64>
    %164 = stablehlo.ceil %163 : tensor<f64>
    %165 = stablehlo.convert %164 : (tensor<f64>) -> tensor<i64>
    %166 = stablehlo.reshape %165 : (tensor<i64>) -> tensor<1xi64>
    %167 = stablehlo.dynamic_iota %166, dim = 0 : (tensor<1xi64>) -> tensor<1xi64>
    %168 = stablehlo.broadcast_in_dim %167, dims = [0] : (tensor<1xi64>) -> tensor<1xi64>
    %169 = stablehlo.multiply %168, %c_12 : tensor<1xi64>
    %170 = stablehlo.broadcast_in_dim %169, dims = [0] : (tensor<1xi64>) -> tensor<1xi64>
    %171 = stablehlo.add %170, %c : tensor<1xi64>
    %172 = stablehlo.reshape %171 : (tensor<1xi64>) -> tensor<1x1xi64>
    %173 = stablehlo.reshape %172 : (tensor<1x1xi64>) -> tensor<1x1x1xi64>
    %dim_33 = tensor.dim %162, %c0 : tensor<?x1xi64>
    %174 = arith.index_cast %dim_33 : index to i64
    %from_elements_34 = tensor.from_elements %c1_i64, %174, %c4096_i64 : tensor<3xi64>
    %175 = stablehlo.dynamic_broadcast_in_dim %173, %from_elements_34, dims = [0, 1, 2] : (tensor<1x1x1xi64>, tensor<3xi64>) -> tensor<1x?x4096xi64>
    %dim_35 = tensor.dim %175, %c1 : tensor<1x?x4096xi64>
    %176 = arith.index_cast %dim_35 : index to i64
    %from_elements_36 = tensor.from_elements %c1_i64, %176, %c4096_i64, %c1_i64 : tensor<4xi64>
    %177 = stablehlo.dynamic_reshape %175, %from_elements_36 : (tensor<1x?x4096xi64>, tensor<4xi64>) -> tensor<1x?x4096x1xi64>
    %178 = stablehlo.dynamic_broadcast_in_dim %162, %from_elements_34, dims = [1, 2] : (tensor<?x1xi64>, tensor<3xi64>) -> tensor<1x?x4096xi64>
    %dim_37 = tensor.dim %178, %c1 : tensor<1x?x4096xi64>
    %179 = arith.index_cast %dim_37 : index to i64
    %from_elements_38 = tensor.from_elements %c1_i64, %179, %c4096_i64, %c1_i64 : tensor<4xi64>
    %180 = stablehlo.dynamic_reshape %178, %from_elements_38 : (tensor<1x?x4096xi64>, tensor<4xi64>) -> tensor<1x?x4096x1xi64>
    %181 = stablehlo.dynamic_broadcast_in_dim %160, %from_elements_34, dims = [2] : (tensor<4096xi64>, tensor<3xi64>) -> tensor<1x?x4096xi64>
    %dim_39 = tensor.dim %181, %c1 : tensor<1x?x4096xi64>
    %182 = arith.index_cast %dim_39 : index to i64
    %from_elements_40 = tensor.from_elements %c1_i64, %182, %c4096_i64, %c1_i64 : tensor<4xi64>
    %183 = stablehlo.dynamic_reshape %181, %from_elements_40 : (tensor<1x?x4096xi64>, tensor<4xi64>) -> tensor<1x?x4096x1xi64>
    %184 = stablehlo.concatenate %177, %180, %183, dim = 3 : (tensor<1x?x4096x1xi64>, tensor<1x?x4096x1xi64>, tensor<1x?x4096x1xi64>) -> tensor<1x?x4096x3xi64>
    %185 = "stablehlo.gather"(%151, %184) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0, 1, 2], start_index_map = [0, 1, 2], index_vector_dim = 3>, indices_are_sorted = false, slice_sizes = array<i64: 1, 1, 1>}> : (tensor<1x3x4096xf32>, tensor<1x?x4096x3xi64>) -> tensor<1x?x4096xf32>
    %186 = shape.shape_of %185 : tensor<1x?x4096xf32> -> tensor<3xindex>
    %187 = shape.num_elements %186 : tensor<3xindex> -> index
    %188 = stablehlo.compute_reshape_shape %187, %c_23 : (index, tensor<2xi64>) -> tensor<2xi64>
    %189 = stablehlo.dynamic_reshape %185, %188 : (tensor<1x?x4096xf32>, tensor<2xi64>) -> tensor<?x4096xf32>
    %190 = stablehlo.transpose %cst_14, dims = [1, 0] : (tensor<14336x4096xf32>) -> tensor<4096x14336xf32>
    %191 = stablehlo.dot %189, %190 : (tensor<?x4096xf32>, tensor<4096x14336xf32>) -> tensor<?x14336xf32>
    %192 = stablehlo.logistic %191 : tensor<?x14336xf32>
    %193 = shape.shape_of %192 : tensor<?x14336xf32> -> tensor<2xindex>
    %194 = shape.shape_of %191 : tensor<?x14336xf32> -> tensor<2xindex>
    %195 = shape.cstr_broadcastable %193, %194 : tensor<2xindex>, tensor<2xindex>
    %196 = shape.assuming %195 -> (tensor<?x14336xf32>) {
      %19688 = shape.broadcast %193, %194 : tensor<2xindex>, tensor<2xindex> -> tensor<2xindex>
      %19689 = stablehlo.dynamic_broadcast_in_dim %192, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19690 = stablehlo.dynamic_broadcast_in_dim %191, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19691 = stablehlo.multiply %19689, %19690 : tensor<?x14336xf32>
      shape.assuming_yield %19691 : tensor<?x14336xf32>
    }
    %197 = shape.shape_of %196 : tensor<?x14336xf32> -> tensor<2xindex>
    %198 = shape.cstr_broadcastable %197, %194 : tensor<2xindex>, tensor<2xindex>
    %199 = shape.assuming %198 -> (tensor<?x14336xf32>) {
      %19688 = shape.broadcast %197, %194 : tensor<2xindex>, tensor<2xindex> -> tensor<2xindex>
      %19689 = stablehlo.dynamic_broadcast_in_dim %196, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19690 = stablehlo.dynamic_broadcast_in_dim %191, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19691 = stablehlo.multiply %19689, %19690 : tensor<?x14336xf32>
      shape.assuming_yield %19691 : tensor<?x14336xf32>
    }
    %200 = stablehlo.transpose %cst_13, dims = [1, 0] : (tensor<4096x14336xf32>) -> tensor<14336x4096xf32>
    %201 = stablehlo.dot %199, %200 : (tensor<?x14336xf32>, tensor<14336x4096xf32>) -> tensor<?x4096xf32>
    %202 = stablehlo.reshape %125 : (tensor<3x2xf32>) -> tensor<3x2x1xf32>
    %dim_41 = tensor.dim %150, %c0 : tensor<?xi64>
    %203 = arith.index_cast %dim_41 : index to i64
    %from_elements_42 = tensor.from_elements %203, %c1_i64 : tensor<2xi64>
    %204 = stablehlo.dynamic_reshape %150, %from_elements_42 : (tensor<?xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %dim_43 = tensor.dim %147, %c0 : tensor<?xi64>
    %205 = arith.index_cast %dim_43 : index to i64
    %from_elements_44 = tensor.from_elements %205, %c1_i64 : tensor<2xi64>
    %206 = stablehlo.dynamic_reshape %147, %from_elements_44 : (tensor<?xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %207 = stablehlo.concatenate %204, %206, dim = 1 : (tensor<?x1xi64>, tensor<?x1xi64>) -> tensor<?x2xi64>
    %208 = "stablehlo.gather"(%202, %207) <{dimension_numbers = #stablehlo.gather<offset_dims = [1], collapsed_slice_dims = [0, 1], start_index_map = [0, 1], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = array<i64: 1, 1, 1>}> : (tensor<3x2x1xf32>, tensor<?x2xi64>) -> tensor<?x1xf32>
    %209 = shape.shape_of %201 : tensor<?x4096xf32> -> tensor<2xindex>
    %210 = shape.shape_of %208 : tensor<?x1xf32> -> tensor<2xindex>
    %211 = shape.cstr_broadcastable %209, %210 : tensor<2xindex>, tensor<2xindex>
    %212 = shape.assuming %211 -> (tensor<?x4096xf32>) {
      %19688 = shape.broadcast %209, %210 : tensor<2xindex>, tensor<2xindex> -> tensor<2xindex>
      %19689 = stablehlo.dynamic_broadcast_in_dim %201, %19688, dims = [0, 1] : (tensor<?x4096xf32>, tensor<2xindex>) -> tensor<?x4096xf32>
      %19690 = stablehlo.dynamic_broadcast_in_dim %208, %19688, dims = [0, 1] : (tensor<?x1xf32>, tensor<2xindex>) -> tensor<?x4096xf32>
      %19691 = stablehlo.multiply %19689, %19690 : tensor<?x4096xf32>
      shape.assuming_yield %19691 : tensor<?x4096xf32>
    }
    %213 = stablehlo.reshape %cst : (tensor<1xf32>) -> tensor<f32>
    %214 = shape.shape_of %212 : tensor<?x4096xf32> -> tensor<2xindex>
    %215 = stablehlo.dynamic_broadcast_in_dim %212, %214, dims = [0, 1] : (tensor<?x4096xf32>, tensor<2xindex>) -> tensor<?x4096xf32>
    %216 = stablehlo.dynamic_broadcast_in_dim %213, %214, dims = [] : (tensor<f32>, tensor<2xindex>) -> tensor<?x4096xf32>
    %217 = stablehlo.multiply %215, %216 : tensor<?x4096xf32>
    %dim_45 = tensor.dim %162, %c0 : tensor<?x1xi64>
    %218 = arith.index_cast %dim_45 : index to i64
    %dim_46 = tensor.dim %212, %c0 : tensor<?x4096xf32>
    %219 = arith.index_cast %dim_46 : index to i64
    %220 = arith.maxsi %218, %219 : i64
    %221 = arith.index_cast %220 : i64 to index
    %from_elements_47 = tensor.from_elements %221, %c4096 : tensor<2xindex>
    %222 = stablehlo.dynamic_broadcast_in_dim %162, %from_elements_47, dims = [0, 1] : (tensor<?x1xi64>, tensor<2xindex>) -> tensor<?x4096xi64>
    %dim_48 = tensor.dim %222, %c0 : tensor<?x4096xi64>
    %223 = arith.index_cast %dim_48 : index to i64
    %from_elements_49 = tensor.from_elements %223, %c4096_i64 : tensor<2xi64>
    %224 = stablehlo.real_dynamic_slice %217, %c_22, %from_elements_49, %c_21 : (tensor<?x4096xf32>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x4096xf32>
    %from_elements_50 = tensor.from_elements %223, %c4096_i64, %c1_i64 : tensor<3xi64>
    %225 = stablehlo.dynamic_reshape %222, %from_elements_50 : (tensor<?x4096xi64>, tensor<3xi64>) -> tensor<?x4096x1xi64>
    %226 = stablehlo.dynamic_iota %from_elements_50, dim = 1 : (tensor<3xi64>) -> tensor<?x4096x1xi64>
    %227 = stablehlo.concatenate %225, %226, dim = 2 : (tensor<?x4096x1xi64>, tensor<?x4096x1xi64>) -> tensor<?x4096x2xi64>
    %228 = "stablehlo.scatter"(%cst_2, %227, %224) <{indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<inserted_window_dims = [0, 1], scatter_dims_to_operand_dims = [0, 1], index_vector_dim = 2>, unique_indices = false}> ({
    ^bb0(%arg129: tensor<f32>, %arg130: tensor<f32>):
      %19688 = stablehlo.add %arg129, %arg130 : tensor<f32>
      stablehlo.return %19688 : tensor<f32>
    }) : (tensor<3x4096xf32>, tensor<?x4096x2xi64>, tensor<?x4096xf32>) -> tensor<3x4096xf32>
    %229 = stablehlo.slice %140 [1:2, 0:2, 0:3] : (tensor<8x2x3xi64>) -> tensor<1x2x3xi64>
    %230 = stablehlo.reshape %229 : (tensor<1x2x3xi64>) -> tensor<2x3xi64>
    %231 = stablehlo.custom_call @byteir.non_zero(%230) {byteir_attrs = {}} : (tensor<2x3xi64>) -> tensor<?x2xi64>
    %dim_51 = tensor.dim %231, %c0 : tensor<?x2xi64>
    %232 = arith.index_cast %dim_51 : index to i64
    %from_elements_52 = tensor.from_elements %232, %c1_i64 : tensor<2xi64>
    %233 = stablehlo.real_dynamic_slice %231, %c_22, %from_elements_52, %c_21 : (tensor<?x2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %dim_53 = tensor.dim %233, %c0 : tensor<?x1xi64>
    %234 = arith.index_cast %dim_53 : index to i64
    %from_elements_54 = tensor.from_elements %234 : tensor<1xi64>
    %235 = stablehlo.dynamic_reshape %233, %from_elements_54 : (tensor<?x1xi64>, tensor<1xi64>) -> tensor<?xi64>
    %from_elements_55 = tensor.from_elements %232, %c2_i64 : tensor<2xi64>
    %236 = stablehlo.real_dynamic_slice %231, %c_24, %from_elements_55, %c_21 : (tensor<?x2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %dim_56 = tensor.dim %236, %c0 : tensor<?x1xi64>
    %237 = arith.index_cast %dim_56 : index to i64
    %from_elements_57 = tensor.from_elements %237 : tensor<1xi64>
    %238 = stablehlo.dynamic_reshape %236, %from_elements_57 : (tensor<?x1xi64>, tensor<1xi64>) -> tensor<?xi64>
    %dim_58 = tensor.dim %238, %c0 : tensor<?xi64>
    %239 = arith.index_cast %dim_58 : index to i64
    %from_elements_59 = tensor.from_elements %239, %c1_i64 : tensor<2xi64>
    %240 = stablehlo.dynamic_reshape %238, %from_elements_59 : (tensor<?xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %dim_60 = tensor.dim %240, %c0 : tensor<?x1xi64>
    %241 = arith.index_cast %dim_60 : index to i64
    %from_elements_61 = tensor.from_elements %c1_i64, %241, %c4096_i64 : tensor<3xi64>
    %242 = stablehlo.dynamic_broadcast_in_dim %173, %from_elements_61, dims = [0, 1, 2] : (tensor<1x1x1xi64>, tensor<3xi64>) -> tensor<1x?x4096xi64>
    %dim_62 = tensor.dim %242, %c1 : tensor<1x?x4096xi64>
    %243 = arith.index_cast %dim_62 : index to i64
    %from_elements_63 = tensor.from_elements %c1_i64, %243, %c4096_i64, %c1_i64 : tensor<4xi64>
    %244 = stablehlo.dynamic_reshape %242, %from_elements_63 : (tensor<1x?x4096xi64>, tensor<4xi64>) -> tensor<1x?x4096x1xi64>
    %245 = stablehlo.dynamic_broadcast_in_dim %240, %from_elements_61, dims = [1, 2] : (tensor<?x1xi64>, tensor<3xi64>) -> tensor<1x?x4096xi64>
    %dim_64 = tensor.dim %245, %c1 : tensor<1x?x4096xi64>
    %246 = arith.index_cast %dim_64 : index to i64
    %from_elements_65 = tensor.from_elements %c1_i64, %246, %c4096_i64, %c1_i64 : tensor<4xi64>
    %247 = stablehlo.dynamic_reshape %245, %from_elements_65 : (tensor<1x?x4096xi64>, tensor<4xi64>) -> tensor<1x?x4096x1xi64>
    %248 = stablehlo.dynamic_broadcast_in_dim %160, %from_elements_61, dims = [2] : (tensor<4096xi64>, tensor<3xi64>) -> tensor<1x?x4096xi64>
    %dim_66 = tensor.dim %248, %c1 : tensor<1x?x4096xi64>
    %249 = arith.index_cast %dim_66 : index to i64
    %from_elements_67 = tensor.from_elements %c1_i64, %249, %c4096_i64, %c1_i64 : tensor<4xi64>
    %250 = stablehlo.dynamic_reshape %248, %from_elements_67 : (tensor<1x?x4096xi64>, tensor<4xi64>) -> tensor<1x?x4096x1xi64>
    %251 = stablehlo.concatenate %244, %247, %250, dim = 3 : (tensor<1x?x4096x1xi64>, tensor<1x?x4096x1xi64>, tensor<1x?x4096x1xi64>) -> tensor<1x?x4096x3xi64>
    %252 = "stablehlo.gather"(%151, %251) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0, 1, 2], start_index_map = [0, 1, 2], index_vector_dim = 3>, indices_are_sorted = false, slice_sizes = array<i64: 1, 1, 1>}> : (tensor<1x3x4096xf32>, tensor<1x?x4096x3xi64>) -> tensor<1x?x4096xf32>
    %253 = shape.shape_of %252 : tensor<1x?x4096xf32> -> tensor<3xindex>
    %254 = shape.num_elements %253 : tensor<3xindex> -> index
    %255 = stablehlo.compute_reshape_shape %254, %c_23 : (index, tensor<2xi64>) -> tensor<2xi64>
    %256 = stablehlo.dynamic_reshape %252, %255 : (tensor<1x?x4096xf32>, tensor<2xi64>) -> tensor<?x4096xf32>
    %257 = stablehlo.dot %256, %190 : (tensor<?x4096xf32>, tensor<4096x14336xf32>) -> tensor<?x14336xf32>
    %258 = stablehlo.logistic %257 : tensor<?x14336xf32>
    %259 = shape.shape_of %258 : tensor<?x14336xf32> -> tensor<2xindex>
    %260 = shape.shape_of %257 : tensor<?x14336xf32> -> tensor<2xindex>
    %261 = shape.cstr_broadcastable %259, %260 : tensor<2xindex>, tensor<2xindex>
    %262 = shape.assuming %261 -> (tensor<?x14336xf32>) {
      %19688 = shape.broadcast %259, %260 : tensor<2xindex>, tensor<2xindex> -> tensor<2xindex>
      %19689 = stablehlo.dynamic_broadcast_in_dim %258, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19690 = stablehlo.dynamic_broadcast_in_dim %257, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19691 = stablehlo.multiply %19689, %19690 : tensor<?x14336xf32>
      shape.assuming_yield %19691 : tensor<?x14336xf32>
    }
    %263 = shape.shape_of %262 : tensor<?x14336xf32> -> tensor<2xindex>
    %264 = shape.cstr_broadcastable %263, %260 : tensor<2xindex>, tensor<2xindex>
    %265 = shape.assuming %264 -> (tensor<?x14336xf32>) {
      %19688 = shape.broadcast %263, %260 : tensor<2xindex>, tensor<2xindex> -> tensor<2xindex>
      %19689 = stablehlo.dynamic_broadcast_in_dim %262, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19690 = stablehlo.dynamic_broadcast_in_dim %257, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19691 = stablehlo.multiply %19689, %19690 : tensor<?x14336xf32>
      shape.assuming_yield %19691 : tensor<?x14336xf32>
    }
    %266 = stablehlo.dot %265, %200 : (tensor<?x14336xf32>, tensor<14336x4096xf32>) -> tensor<?x4096xf32>
    %dim_68 = tensor.dim %238, %c0 : tensor<?xi64>
    %267 = arith.index_cast %dim_68 : index to i64
    %from_elements_69 = tensor.from_elements %267, %c1_i64 : tensor<2xi64>
    %268 = stablehlo.dynamic_reshape %238, %from_elements_69 : (tensor<?xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %dim_70 = tensor.dim %235, %c0 : tensor<?xi64>
    %269 = arith.index_cast %dim_70 : index to i64
    %from_elements_71 = tensor.from_elements %269, %c1_i64 : tensor<2xi64>
    %270 = stablehlo.dynamic_reshape %235, %from_elements_71 : (tensor<?xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %271 = stablehlo.concatenate %268, %270, dim = 1 : (tensor<?x1xi64>, tensor<?x1xi64>) -> tensor<?x2xi64>
    %272 = "stablehlo.gather"(%202, %271) <{dimension_numbers = #stablehlo.gather<offset_dims = [1], collapsed_slice_dims = [0, 1], start_index_map = [0, 1], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = array<i64: 1, 1, 1>}> : (tensor<3x2x1xf32>, tensor<?x2xi64>) -> tensor<?x1xf32>
    %273 = shape.shape_of %266 : tensor<?x4096xf32> -> tensor<2xindex>
    %274 = shape.shape_of %272 : tensor<?x1xf32> -> tensor<2xindex>
    %275 = shape.cstr_broadcastable %273, %274 : tensor<2xindex>, tensor<2xindex>
    %276 = shape.assuming %275 -> (tensor<?x4096xf32>) {
      %19688 = shape.broadcast %273, %274 : tensor<2xindex>, tensor<2xindex> -> tensor<2xindex>
      %19689 = stablehlo.dynamic_broadcast_in_dim %266, %19688, dims = [0, 1] : (tensor<?x4096xf32>, tensor<2xindex>) -> tensor<?x4096xf32>
      %19690 = stablehlo.dynamic_broadcast_in_dim %272, %19688, dims = [0, 1] : (tensor<?x1xf32>, tensor<2xindex>) -> tensor<?x4096xf32>
      %19691 = stablehlo.multiply %19689, %19690 : tensor<?x4096xf32>
      shape.assuming_yield %19691 : tensor<?x4096xf32>
    }
    %277 = shape.shape_of %276 : tensor<?x4096xf32> -> tensor<2xindex>
    %278 = stablehlo.dynamic_broadcast_in_dim %276, %277, dims = [0, 1] : (tensor<?x4096xf32>, tensor<2xindex>) -> tensor<?x4096xf32>
    %279 = stablehlo.dynamic_broadcast_in_dim %213, %277, dims = [] : (tensor<f32>, tensor<2xindex>) -> tensor<?x4096xf32>
    %280 = stablehlo.multiply %278, %279 : tensor<?x4096xf32>
    %dim_72 = tensor.dim %240, %c0 : tensor<?x1xi64>
    %281 = arith.index_cast %dim_72 : index to i64
    %dim_73 = tensor.dim %276, %c0 : tensor<?x4096xf32>
    %282 = arith.index_cast %dim_73 : index to i64
    %283 = arith.maxsi %281, %282 : i64
    %284 = arith.index_cast %283 : i64 to index
    %from_elements_74 = tensor.from_elements %284, %c4096 : tensor<2xindex>
    %285 = stablehlo.dynamic_broadcast_in_dim %240, %from_elements_74, dims = [0, 1] : (tensor<?x1xi64>, tensor<2xindex>) -> tensor<?x4096xi64>
    %dim_75 = tensor.dim %285, %c0 : tensor<?x4096xi64>
    %286 = arith.index_cast %dim_75 : index to i64
    %from_elements_76 = tensor.from_elements %286, %c4096_i64 : tensor<2xi64>
    %287 = stablehlo.real_dynamic_slice %280, %c_22, %from_elements_76, %c_21 : (tensor<?x4096xf32>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x4096xf32>
    %from_elements_77 = tensor.from_elements %286, %c4096_i64, %c1_i64 : tensor<3xi64>
    %288 = stablehlo.dynamic_reshape %285, %from_elements_77 : (tensor<?x4096xi64>, tensor<3xi64>) -> tensor<?x4096x1xi64>
    %289 = stablehlo.dynamic_iota %from_elements_77, dim = 1 : (tensor<3xi64>) -> tensor<?x4096x1xi64>
    %290 = stablehlo.concatenate %288, %289, dim = 2 : (tensor<?x4096x1xi64>, tensor<?x4096x1xi64>) -> tensor<?x4096x2xi64>
    %291 = "stablehlo.scatter"(%228, %290, %287) <{indices_are_sorted = false, scatter_dimension_numbers = #stablehlo.scatter<inserted_window_dims = [0, 1], scatter_dims_to_operand_dims = [0, 1], index_vector_dim = 2>, unique_indices = false}> ({
    ^bb0(%arg129: tensor<f32>, %arg130: tensor<f32>):
      %19688 = stablehlo.add %arg129, %arg130 : tensor<f32>
      stablehlo.return %19688 : tensor<f32>
    }) : (tensor<3x4096xf32>, tensor<?x4096x2xi64>, tensor<?x4096xf32>) -> tensor<3x4096xf32>
    %292 = stablehlo.slice %140 [2:3, 0:2, 0:3] : (tensor<8x2x3xi64>) -> tensor<1x2x3xi64>
    %293 = stablehlo.reshape %292 : (tensor<1x2x3xi64>) -> tensor<2x3xi64>
    %294 = stablehlo.custom_call @byteir.non_zero(%293) {byteir_attrs = {}} : (tensor<2x3xi64>) -> tensor<?x2xi64>
    %dim_78 = tensor.dim %294, %c0 : tensor<?x2xi64>
    %295 = arith.index_cast %dim_78 : index to i64
    %from_elements_79 = tensor.from_elements %295, %c1_i64 : tensor<2xi64>
    %296 = stablehlo.real_dynamic_slice %294, %c_22, %from_elements_79, %c_21 : (tensor<?x2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %dim_80 = tensor.dim %296, %c0 : tensor<?x1xi64>
    %297 = arith.index_cast %dim_80 : index to i64
    %from_elements_81 = tensor.from_elements %297 : tensor<1xi64>
    %298 = stablehlo.dynamic_reshape %296, %from_elements_81 : (tensor<?x1xi64>, tensor<1xi64>) -> tensor<?xi64>
    %from_elements_82 = tensor.from_elements %295, %c2_i64 : tensor<2xi64>
    %299 = stablehlo.real_dynamic_slice %294, %c_24, %from_elements_82, %c_21 : (tensor<?x2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %dim_83 = tensor.dim %299, %c0 : tensor<?x1xi64>
    %300 = arith.index_cast %dim_83 : index to i64
    %from_elements_84 = tensor.from_elements %300 : tensor<1xi64>
    %301 = stablehlo.dynamic_reshape %299, %from_elements_84 : (tensor<?x1xi64>, tensor<1xi64>) -> tensor<?xi64>
    %dim_85 = tensor.dim %301, %c0 : tensor<?xi64>
    %302 = arith.index_cast %dim_85 : index to i64
    %from_elements_86 = tensor.from_elements %302, %c1_i64 : tensor<2xi64>
    %303 = stablehlo.dynamic_reshape %301, %from_elements_86 : (tensor<?xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %dim_87 = tensor.dim %303, %c0 : tensor<?x1xi64>
    %304 = arith.index_cast %dim_87 : index to i64
    %from_elements_88 = tensor.from_elements %c1_i64, %304, %c4096_i64 : tensor<3xi64>
    %305 = stablehlo.dynamic_broadcast_in_dim %173, %from_elements_88, dims = [0, 1, 2] : (tensor<1x1x1xi64>, tensor<3xi64>) -> tensor<1x?x4096xi64>
    %dim_89 = tensor.dim %305, %c1 : tensor<1x?x4096xi64>
    %306 = arith.index_cast %dim_89 : index to i64
    %from_elements_90 = tensor.from_elements %c1_i64, %306, %c4096_i64, %c1_i64 : tensor<4xi64>
    %307 = stablehlo.dynamic_reshape %305, %from_elements_90 : (tensor<1x?x4096xi64>, tensor<4xi64>) -> tensor<1x?x4096x1xi64>
    %308 = stablehlo.dynamic_broadcast_in_dim %303, %from_elements_88, dims = [1, 2] : (tensor<?x1xi64>, tensor<3xi64>) -> tensor<1x?x4096xi64>
    %dim_91 = tensor.dim %308, %c1 : tensor<1x?x4096xi64>
    %309 = arith.index_cast %dim_91 : index to i64
    %from_elements_92 = tensor.from_elements %c1_i64, %309, %c4096_i64, %c1_i64 : tensor<4xi64>
    %310 = stablehlo.dynamic_reshape %308, %from_elements_92 : (tensor<1x?x4096xi64>, tensor<4xi64>) -> tensor<1x?x4096x1xi64>
    %311 = stablehlo.dynamic_broadcast_in_dim %160, %from_elements_88, dims = [2] : (tensor<4096xi64>, tensor<3xi64>) -> tensor<1x?x4096xi64>
    %dim_93 = tensor.dim %311, %c1 : tensor<1x?x4096xi64>
    %312 = arith.index_cast %dim_93 : index to i64
    %from_elements_94 = tensor.from_elements %c1_i64, %312, %c4096_i64, %c1_i64 : tensor<4xi64>
    %313 = stablehlo.dynamic_reshape %311, %from_elements_94 : (tensor<1x?x4096xi64>, tensor<4xi64>) -> tensor<1x?x4096x1xi64>
    %314 = stablehlo.concatenate %307, %310, %313, dim = 3 : (tensor<1x?x4096x1xi64>, tensor<1x?x4096x1xi64>, tensor<1x?x4096x1xi64>) -> tensor<1x?x4096x3xi64>
    %315 = "stablehlo.gather"(%151, %314) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0, 1, 2], start_index_map = [0, 1, 2], index_vector_dim = 3>, indices_are_sorted = false, slice_sizes = array<i64: 1, 1, 1>}> : (tensor<1x3x4096xf32>, tensor<1x?x4096x3xi64>) -> tensor<1x?x4096xf32>
    %316 = shape.shape_of %315 : tensor<1x?x4096xf32> -> tensor<3xindex>
    %317 = shape.num_elements %316 : tensor<3xindex> -> index
    %318 = stablehlo.compute_reshape_shape %317, %c_23 : (index, tensor<2xi64>) -> tensor<2xi64>
    %319 = stablehlo.dynamic_reshape %315, %318 : (tensor<1x?x4096xf32>, tensor<2xi64>) -> tensor<?x4096xf32>
    %320 = stablehlo.dot %319, %190 : (tensor<?x4096xf32>, tensor<4096x14336xf32>) -> tensor<?x14336xf32>
    %321 = stablehlo.logistic %320 : tensor<?x14336xf32>
    %322 = shape.shape_of %321 : tensor<?x14336xf32> -> tensor<2xindex>
    %323 = shape.shape_of %320 : tensor<?x14336xf32> -> tensor<2xindex>
    %324 = shape.cstr_broadcastable %322, %323 : tensor<2xindex>, tensor<2xindex>
    %325 = shape.assuming %324 -> (tensor<?x14336xf32>) {
      %19688 = shape.broadcast %322, %323 : tensor<2xindex>, tensor<2xindex> -> tensor<2xindex>
      %19689 = stablehlo.dynamic_broadcast_in_dim %321, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19690 = stablehlo.dynamic_broadcast_in_dim %320, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19691 = stablehlo.multiply %19689, %19690 : tensor<?x14336xf32>
      shape.assuming_yield %19691 : tensor<?x14336xf32>
    }
    %326 = shape.shape_of %325 : tensor<?x14336xf32> -> tensor<2xindex>
    %327 = shape.cstr_broadcastable %326, %323 : tensor<2xindex>, tensor<2xindex>
    %328 = shape.assuming %327 -> (tensor<?x14336xf32>) {
      %19688 = shape.broadcast %326, %323 : tensor<2xindex>, tensor<2xindex> -> tensor<2xindex>
      %19689 = stablehlo.dynamic_broadcast_in_dim %325, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19690 = stablehlo.dynamic_broadcast_in_dim %320, %19688, dims = [0, 1] : (tensor<?x14336xf32>, tensor<2xindex>) -> tensor<?x14336xf32>
      %19691 = stablehlo.multiply %19689, %19690 : tensor<?x14336xf32>
      shape.assuming_yield %19691 : tensor<?x14336xf32>
    }
    %329 = stablehlo.dot %328, %200 : (tensor<?x14336xf32>, tensor<14336x4096xf32>) -> tensor<?x4096xf32>
    %dim_95 = tensor.dim %301, %c0 : tensor<?xi64>
    %330 = arith.index_cast %dim_95 : index to i64
    %from_elements_96 = tensor.from_elements %330, %c1_i64 : tensor<2xi64>
    %331 = stablehlo.dynamic_reshape %301, %from_elements_96 : (tensor<?xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %dim_97 = tensor.dim %298, %c0 : tensor<?xi64>
    %332 = arith.index_cast %dim_97 : index to i64
    %from_elements_98 = tensor.from_elements %332, %c1_i64 : tensor<2xi64>
    %333 = stablehlo.dynamic_reshape %298, %from_elements_98 : (tensor<?xi64>, tensor<2xi64>) -> tensor<?x1xi64>
    %334 = stablehlo.concatenate %331, %333, dim = 1 : (tensor<?x1xi64>, tensor<?x1xi64>) -> tensor<?x2xi64>
    %335 = "stablehlo.gather"(%202, %334) <{dimension_numbers = #stablehlo.gather<offset_dims = [1], collapsed_slice_dims = [0, 1], start_index_map = [0, 1], index_vector_dim = 1>, indices_are_sorted = false, slice_sizes = array<i64: 1, 1, 1>}> : (tensor<3x2x1xf32>, tensor<?x2xi64>) -> tensor<?x1xf32>
    %336 = shape.shape_of %329 : tensor<?x4096xf32> -> tensor<2xindex>
    %337 = shape.shape_of %335 : tensor<?x1xf32> -> tensor<2xindex>
    %338 = shape.cstr_broadcastable %336, %337 : tensor<2xindex>, tensor<2xindex>
    %339 = shape.assuming %338 -> (tensor<?x4096xf32>) {
      %19688 = shape.broadcast %336, %337 : tensor<2xindex>, tensor<2xindex> -> tensor<2xindex>
      %19689 = stablehlo.dynamic_broadcast_in_dim %329, %19688, dims = [0, 1] : (tensor<?x4096xf32>, tensor<2xindex>) -> tensor<?x4096xf32>
      %19690 = stablehlo.dynamic_broadcast_in_dim %335, %19688, dims = [0, 1] : (tensor<?x1xf32>, tensor<2xindex>) -> tensor<?x4096xf32>
